<a href="https://colab.research.google.com/github/sidchaubey/Pratice_Python/blob/master/Copy_of_pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [ ]:
 
import pandas as pd
import numpy as np
import seaborn as sns
 
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
birds = pd.DataFrame(data=data, index=labels)

In [ ]:
birds.head()

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [ ]:
birds.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [ ]:
birds.head(2)

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
birds[["birds", "age"]]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [ ]:
birds.iloc[[2,3,7]]

        birds  age  visits priority
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
h      Cranes  NaN       2      yes

**6. select the rows where the number of visits is less than 4**

In [ ]:
birds[birds["visits"]<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [ ]:
birds[['birds','visits']][birds['age'].isnull()]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [ ]:
birds[(birds['birds']=='Cranes') & (birds['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [ ]:
birds[(birds['age']>=2) & (birds['age']<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [ ]:
a = birds.groupby(['birds'])
type(a)
 
a.get_group('Cranes').sum()['visits']

12

**11. Calculate the mean age for each different birds in dataframe.**

In [ ]:
 a = birds.groupby(['birds'])
type(a)
 
a.mean()

            age  visits
birds
Cranes      3.5     3.0
plovers     3.5     2.5
spoonbills  6.0     3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [ ]:
birds['k'] = np.array([i for i in range(len(birds))])

In [ ]:
birds.head()

        birds  age  visits priority  k
a      Cranes  3.5       2      yes  0
b      Cranes  4.0       4      yes  1
c     plovers  1.5       3       no  2
d  spoonbills  NaN       4      yes  3
e  spoonbills  6.0       3       no  4

**13. Find the number of each type of birds in dataframe (Counts)**

In [ ]:
birds['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [ ]:
birds.columns

Index(['birds', 'age', 'visits', 'priority', 'k'], dtype='object')

In [65]:
#:birds.sort_values(by=['age'],ascending=False,axis=1)

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [ ]:
birds['priority_yorn']= birds['priority'].apply(lambda x: 1 if x=='yes' else 0)

In [ ]:
birds.head()

        birds  age  visits priority  k  priority_yorn
a      Cranes  3.5       2      yes  0              1
b      Cranes  4.0       4      yes  1              1
c     plovers  1.5       3       no  2              0
d  spoonbills  NaN       4      yes  3              1
e  spoonbills  6.0       3       no  4              0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [ ]:
birds['birds']= birds['birds'].apply(lambda x: 'trumpeters' if x=='Cranes' else x)

In [ ]:
birds.head()

        birds  age  visits priority  k  priority_yorn
a  trumpeters  3.5       2      yes  0              1
b  trumpeters  4.0       4      yes  1              1
c     plovers  1.5       3       no  2              0
d  spoonbills  NaN       4      yes  3              1
e  spoonbills  6.0       3       no  4              0